## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

data=[4,8,15,16,23,42]
data=pd.Series(data)

In [2]:
data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
type(data)

pandas.core.series.Series

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [4]:
data1=[1,2,3,4,5,6,7,8,9,10]

data1=pd.Series(data1)
print(data1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data:

Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [5]:
Name=['Alice','Bob','Claire']
Age=[25,30,27]
Gender=['Female','Male','Female']

In [25]:
data={'Names':Name,"Age":Age,"Gender":Gender}
data=pd.DataFrame(data)

In [10]:
print(data)

    Names  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

--A DataFrame is a two-dimensional tabular data structure that can store data of different types in columns

--A Series is a 1-dimensional labeled array capable of holding any data type

for example

In [11]:
print(data)   #data is a type of Dataframe

    Names  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
type(data)

pandas.core.frame.DataFrame

In [13]:
data['Names']  //Example of Series

0     Alice
1       Bob
2    Claire
Name: Names, dtype: object

In [14]:
type(data['Names'])

pandas.core.series.Series

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [15]:
# 1. head():- to show the top n data

data1.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
# 2. tail():- to show bottom n records
data1.tail(2)

8     9
9    10
dtype: int64

In [21]:
# 3. sort_values(): to sort the Data based on the conditions
data.sort_values('Age')

    Names  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [26]:
# drop(): to drop record from dataframe
data.drop(0)

    Names  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

--Both Series and DataFrame are mutable, which means we can modify their contents, add or remove data, and change their structure after creation.

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [28]:
Name

['Alice', 'Bob', 'Claire']

In [29]:
Age

[25, 30, 27]

In [30]:
Gender

['Female', 'Male', 'Female']

In [31]:
Name=pd.Series(Name)
Age=pd.Series(Age)
Gender=pd.Series(Gender)

print(type(Name))

<class 'pandas.core.series.Series'>

In [32]:
type(Age)

pandas.core.series.Series

In [33]:
type(Gender)

pandas.core.series.Series

In [34]:
series_data={'Names':Name,'Age':Age,'Gender':Gender}

In [35]:
df=pd.DataFrame(series_data)
df

    Names  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [36]:
type(df)

pandas.core.frame.DataFrame